# Исходный код

# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов
# исходной последовательности.
# Пример:
# - Ввод:[1,1,2,4,5,6,7,7,8], результат: [2,4,5,6,8]

# def lst_print(a,b):
#     lst = []
#     for i in range(a, b):
#         n = int(input("Введите значение элемента х = "))
#         lst.append(n)
#     return lst
# x = lst_print(0,9)
#
# # Для быстроты проверки
# # x = [1,1,2,4,5,6,7,7,8]
# lst = []
#
# for i in x:
#     if x.count(i) < 2:
#         lst.append(i)
#
# print(f"Ввод: {x}, результат: {lst}")


# Оптимизируем код
lst = [1,1,2,4,5,6,7,7,8]
lst = [lst[i] for i in lst if lst.count(i) < 2]
print(f"Результат: {lst}")